__author__ = 'Круглов Сергей'

"""
== Лото ==

Правила игры в лото.

Игра ведется с помощью специальных карточек, на которых отмечены числа, 
и фишек (бочонков) с цифрами.

Количество бочонков — 90 штук (с цифрами от 1 до 90).

Каждая карточка содержит 3 строки по 9 клеток. В каждой строке по 5 случайных цифр, 
расположенных по возрастанию. Все цифры в карточке уникальны. Пример карточки:

--------------------------
    9 43 62          74 90
 2    27    75 78    82
   41 56 63     76      86 
--------------------------

В игре 2 игрока: пользователь и компьютер. Каждому в начале выдается 
случайная карточка. 

Каждый ход выбирается один случайный бочонок и выводится на экран.
Также выводятся карточка игрока и карточка компьютера.

Пользователю предлагается зачеркнуть цифру на карточке или продолжить.
Если игрок выбрал "зачеркнуть":
	Если цифра есть на карточке - она зачеркивается и игра продолжается.
	Если цифры на карточке нет - игрок проигрывает и игра завершается.
Если игрок выбрал "продолжить":
	Если цифра есть на карточке - игрок проигрывает и игра завершается.
	Если цифры на карточке нет - игра продолжается.
	
Побеждает тот, кто первый закроет все числа на своей карточке.

Пример одного хода:

Новый бочонок: 70 (осталось 76)
------ Ваша карточка -----
 6  7          49    57 58
   14 26     -    78    85
23 33    38    48    71   
--------------------------
-- Карточка компьютера ---
 7 87     - 14    11      
      16 49    55 88    77    
   15 20     -       76  -
--------------------------
Зачеркнуть цифру? (y/n)

Подсказка: каждый следующий случайный бочонок из мешка удобно получать 
с помощью функции-генератора.

Подсказка: для работы с псевдослучайными числами удобно использовать 
модуль random: http://docs.python.org/3/library/random.html

"""

import random

def get_one_number(barrel):
	elem = random.randint(0,len(barrel))
	current_number = barrel[elem]
	print(current_number)
	barrel.pop(elem)
	print(len(barrel), barrel)
	return current_number


def check_and_fix_card(card_for_check, barrel):
	check = {x: 0 for x in range(10)}
	for elem in card_for_check:
		if check[elem//10] < 2:
			check[elem//10] += 1
		else:
			print(card_for_check)
			print(check)
			print(elem)
			card_for_check.remove(elem)
			card_for_check.append(get_one_number(barrel))
			check_and_fix_card(card_for_check, barrel)


def get_card(num=15):
	lst = [x for x in range(1,91)]
	card = []
	for i in range(num):
		card.append(get_one_number(lst))
	check_and_fix_card(card, lst)
	return card


print(sorted(get_card()))
